INSERT INTO product_type(name)
VALUES ('Яблоко'),
       ('Груша');

INSERT INTO product_sort(type_id, name)
VALUES (2, 'Антоновка'),
       (2, 'Голден'),
       (3, 'Китайская'),
       (3, 'Дюшес');

INSERT INTO product(type_id, sort_id, description)
VALUES (2, 2, 'россыпью, в палетах'),
       (2, 3, 'расфасованные, в пакетах'),
       (3, 4, 'расфасованные, в коробках'),
       (3, 5, 'россыпью, в палетах');

INSERT INTO supplier(name, address, phone, inn)
VALUES ('ООО ФруТрейд', 'Самара', 88463391562, 1516161451819),
       ('ООО Древо', 'Тольятти', 88485569899, 1516161451865),
       ('ЗАО Агропарк', 'Казань', 79272600035, 1516161451697),
       ('ООО Садовод', 'Саратов', 79295444788, 1516161458978);

INSERT INTO product_price(supplier_id, product_id, period_beginning, period_end, price, measure)
VALUES (2, 2, '2024-01-30', '2024-06-28', 100, 'KG'),
       (2, 3, '2024-01-30', '2024-06-28', 70, 'KG'),
       (2, 4, '2024-01-30', '2024-06-28', 80, 'KG'),
       (2, 5, '2024-01-30', '2024-06-28', 130, 'KG'),
       (3, 2, '2024-01-30', '2024-06-28', 120, 'KG'),
       (3, 3, '2024-01-30', '2024-06-28', 110, 'KG'),
       (3, 5, '2024-01-30', '2024-06-28', 60, 'KG'),
       (4, 2, '2024-01-30', '2024-06-28', 60, 'KG'),
       (4, 3, '2024-01-30', '2024-06-28', 90, 'KG'),
       (4, 4, '2024-01-30', '2024-06-28', 100, 'KG'),
       (4, 5, '2024-01-30', '2024-06-28', 90, 'KG'),
       (5, 2, '2024-01-30', '2024-06-28', 70, 'KG'),
       (5, 3, '2024-01-30', '2024-06-28', 50, 'KG'),
       (5, 4, '2024-01-30', '2024-06-28', 80, 'KG'),
       (5, 5, '2024-01-30', '2024-06-28', 60, 'KG');